cases/Normal_DRS/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           volScalarField;
    location        "0";
    object          k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.96;

boundaryField
{
    #includeEtc     "caseDicts/setConstraintTypes"
    farfield
    {
        type            freestream;
        freestreamValue uniform 0.96;
        value           uniform 0.96;
    }
    mainWing
    {
        type            kqRWallFunction;
        value           uniform 0.96;
    }
    flap
    {
        type            kqRWallFunction;
        value           uniform 0.96;
    }
    nonCouple1
    {
        type            zeroGradient;
    }
    nonCouple2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
