cases/Normal_DRS/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    farfield
    {
        type            calculated;
        value           uniform 0;
    }

    mainWing
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    flap
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    nonCouple1
    {
        type            calculated;
        value           uniform 0;
    }

    nonCouple2
    {
        type            calculated;
        value           uniform 0;
    }
}

// ************************************************************************* //
