cases/Normal_DRS/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

// Classic DRS opening motion:
//
// Initial physical geometry: +20 deg
// Integrated mesh rotation:  -20 deg
// Final physical geometry:     0 deg
//
// 0.000–0.050 s: hold closed
// 0.050–0.450 s: smooth opening
// 0.450 s onward: hold open

mover
{
    type            motionSolver;

    libs            ("libfvMotionSolvers.so");

    motionSolver    solidBody;

    cellZone        rotor;

    solidBodyMotionFunction  rotatingMotion;

    origin          (0.290000 0.050000 0.100000);
    axis            (0 0 1);

    omega           table
    (
            (0.000000 0.000000000000)
            (0.050000 -0.000000000000)
            (0.060000 -0.107605352194)
            (0.070000 -0.214547281610)
            (0.080000 -0.320166455690)
            (0.090000 -0.423811697104)
            (0.100000 -0.524843998475)
            (0.110000 -0.622640462066)
            (0.120000 -0.716598140160)
            (0.130000 -0.806137752427)
            (0.140000 -0.890707257381)
            (0.150000 -0.969785255904)
            (0.160000 -1.042884205838)
            (0.170000 -1.109553427849)
            (0.180000 -1.169381884013)
            (0.190000 -1.222000712004)
            (0.200000 -1.267085499248)
            (0.210000 -1.304358283041)
            (0.220000 -1.333589264275)
            (0.230000 -1.354598224232)
            (0.240000 -1.367255635687)
            (0.250000 -1.371483461489)
            (0.260000 -1.367255635687)
            (0.270000 -1.354598224232)
            (0.280000 -1.333589264275)
            (0.290000 -1.304358283041)
            (0.300000 -1.267085499248)
            (0.310000 -1.222000712004)
            (0.320000 -1.169381884013)
            (0.330000 -1.109553427849)
            (0.340000 -1.042884205838)
            (0.350000 -0.969785255904)
            (0.360000 -0.890707257381)
            (0.370000 -0.806137752427)
            (0.380000 -0.716598140160)
            (0.390000 -0.622640462066)
            (0.400000 -0.524843998475)
            (0.410000 -0.423811697104)
            (0.420000 -0.320166455690)
            (0.430000 -0.214547281610)
            (0.440000 -0.107605352194)
            (0.450000 -0.000000000000)
            (10.000000 0.000000000000)
    );
}

// ************************************************************************* //
