cases/Normal_DRS/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forceCoeffs
{
    type            forceCoeffs;
    libs            ( "libforces.so" );
    log             false;
    patches         ( mainWing flap );
    p               p;
    U               U;
    rho             rhoInf;
    rhoInf          1.225;
    CofR            ( 0.05 0 0.1 );
    liftDir         ( 0 1 0 );
    dragDir         ( 1 0 0 );
    pitchAxis       ( 0 0 1 );
    magUInf         80;
    lRef            0.2;
    Aref            0.004;
    writeControl    adjustableRunTime;
    writeInterval   0.0002;
}

yPlus
{
    type            yPlus;
    libs            ( "libfieldFunctionObjects.so" );
    executeControl  writeTime;
    writeControl    writeTime;
}


// ************************************************************************* //
