cases/Normal_DRS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    "pcorr.*"
    {
        solver              GAMG;
        smoother            GaussSeidel;
        cacheAgglomeration  no;
        tolerance           0.02;
        relTol              0;
    }

    MeshPhi
    {
        solver              smoothSolver;
        smoother            symGaussSeidel;
        tolerance           1e-8;
        relTol              0.01;
    }

    p
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0.05;
        smoother            DICGaussSeidel;
        cacheAgglomeration  true;
    }

    pFinal
    {
        $p;
        relTol              0;
    }

    "(U|k|omega)"
    {
        solver              smoothSolver;
        smoother            symGaussSeidel;
        tolerance           1e-6;
        relTol              0.1;
    }

    "(U|k|omega)Final"
    {
        solver              smoothSolver;
        smoother            symGaussSeidel;
        tolerance           1e-6;
        relTol              0;
    }
}

PIMPLE
{
    momentumPredictor           yes;

    nOuterCorrectors            2;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    1;

    correctPhi                  yes;
    correctMeshPhi              yes;

    checkMeshCourantNo          yes;
    moveMeshOuterCorrectors     false;

    pRefCell                    0;
    pRefValue                   0;
}

// ************************************************************************* //
